In [1]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.28-cp38-cp38-manylinux1_x86_64.whl (37.6 MB)
     |████████████████████████████████| 37.6 MB 29 kB/s  eta 0:00:01     |███████████▏                    | 13.1 MB 66 kB/s eta 0:06:08     |███████████████████▋            | 23.1 MB 70 kB/s eta 0:03:26     |████████████████████████████    | 32.9 MB 169 kB/s eta 0:00:28     |█████████████████████████████▋  | 34.8 MB 441 kB/s eta 0:00:07
Requirement already satisfied: protobuf>=3.0.0 in /opt/conda/lib/python3.8/site-packages (from mysql-connector-python) (3.14.0)
Requirement already satisfied: six>=1.9 in /opt/conda/lib/python3.8/site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.28

In [2]:
import mysql.connector as connection
import pandas as pd

In [3]:
try:
    mydb = connection.connect(host="172.17.0.3", database = 'sakila',user="my_usuario", passwd="s3cr3t",use_pure=True)
    query = "Select * from actor;"
    result_dataFrame = pd.read_sql(query,mydb)
    mydb.close() #close the connection
except Exception as e:
    mydb.close()
    print(str(e))

In [5]:
#result_dataFrame = pd.read_sql(query, mydb)
result_dataFrame.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33